import streamlit as st
import time

page_bg_img = '''<style>
.stApp {
    background-image: url("https://files.gqthailand.com/uploads/Li3.jpg");
    background-size: cover;
}
</style>'''
st.markdown(page_bg_img, unsafe_allow_html=True)
st.markdown("<h1 style='color: white;text-shadow: 2px 2px 4px #000000;'>Liverpool Team</h1>", unsafe_allow_html=True)
st.write("มาทำความรู้จักประวัติของ สโมสร ลิเวอร์พูล สโมสรฟุตบอลที่มีประวัติความเป็นมายาวนาน และเป็นทีมที่มีฐานกองเชียรืที่มากทีมหนึ่งของโลกจากอดีดจนถึงปัจจุบัน ")
st.image('an1.jpeg')

st.sidebar.markdown("<h1 style='color: red;text-shadow: 2px 2px 8px rgba(0,0,0,0.5);'>เมนู/Menu</h1>", unsafe_allow_html=True)

if st.sidebar.button("ประวัติของทีม/Team History"):
    with st.spinner("....."):
         time.sleep(1)

    st.header("จุดเริ่มต้นที่ถนนแอนฟิลด์")
    st.write("สโมสรลิเวอร์พูลก่อตั้งขึ้นวันที่ 15 มีนาคม ค.ศ. 1892 โดย John Houlding ซึ่งนักธุรกิจท้องถิ่น และว่าที่นายกเทศมนตรีเมืองลิเวอร์พูล เขาเริ่มจากการเช่าพื้นที่บริเวณถนนแอนฟิลด์ ของเมืองลิเวอร์ุัพูลเพื่อสร้างสนามฟุตบอล และได้ปล่อยให้ทางสโมสรเอฟเวอร์ตันเช่าในปีค.ศ. 1884 จนกระทั่งเอฟเวอร์ตันเข้าเป็นสมาชิิกฟุตบอลลีก และไม่ต่อสัญญาเช่าอีกในปีค.ศ. 1892 เนื่องจากเขาต้องการขึ้นค่าเช่าสนามจาก 100 ปอนด์ เป็น 250 ปอนด์ต่อปี และพยายามจะเข้าบริหารงาน ของสโมสร ทางเอฟเวอตันจึงตัดสินใจย้ายไปใช้สนามอีกฝากของสวนสาธารณะสแตนลี่ย์พาร์ค และใช้ชื่อสนามว่า กูดิสัน พาร์ค มาจนถึงทุกวันนี้ และเมื่อสนามไม่ได้ใช้ประโยชน์ John Houlding จึงจัดตั้งทีมฟุตบอลของเขาขึ้นมาเองโดยให้เพื่อนสนิทอย่าง John McKenna มาเป็นประธานสโมสรและตั้งชื่อทีมว่าลิเวอร์พูล ฟุตบอล คลับอย่างในปัจจุบัน")
    st.header("การเริ่มต้นอย่างสง่างาม")
    st.write("หลังจากตั้งสโมสรก่อตั้งขึ้นมาไม่นาน ลิเวอร์พูลก็โชว์ผลงานได้อย่างยอดเยี่ยมมาโดยตลอด โดยประเดิมสนามนัดแรกด้วยการเอาชนะทีม Rotherham Town ไปถึง 7-1 อีกทั้งการแข่งขันฟุตบอลลีก ของแคว้นแลงคาเชียร์ ซึ่งสามารถเอาชนะทีม Higher Walton ด้วยสกอร์ 8-0 ที่สนามแอนฟิลด์ โดยลิเวอร์พูลลงแข่งทั้งหมด 22 นัด ชนะถึง 17 นัด และได้แชมป์ไปครอง ส่งผลให้ทางสโมสรสามารถสมัครเข้าร่วมการแข่งขันฟุตบอลลีก โดยให้ลงเล่นในดีวิชั่น 2 ก่อน ในฤดูกาล 1893-1894 ซึ่งสโมสรสามารถเก็บชัยชนะได้แบบ 100% (ทั้งหมด 28 นัด) แต่การคว้าแชมป์ลีกดิวิชั่น 2 ในตอนนั้นยังไม่ได้เลื่อนชั้นโดยทันที ต้องไปแข่งนัดชิงดำกับทีมอันดับสองก่อน โดยทีมอันดับสองในขณะนั้นคือ ทีมนิวตัน ฮีธ หรือก็คือทีมแมนเชสเตอร์ ยูไนเต็ดในปัจจุบัน ซึ่งลิเวอร์พูลก็เอาชนะไปได้ 2-0 และได้เลื่อนขึ้นสู่ดิวิชั่น 1 ได้ในที่สุด ทั้งนี้สโมสรได้เลือกสัญลักษณ์เป็นนกลิเวอร์เบิร์ด ซึ่งเป็นนกแถบทะเลไอริช บริเวญแม่น้ำเมอร์ซี่ โดยที่ปากนกนั้นคาบใบไม้ไว้")
    st.header("บิล แชงค์ลี่ย์")
    st.image("bill.jpeg")
    st.write("ในช่วงศตวรรษที่ 20-50 ลิเวอร์พูลไม่ใช่ทีมที่ยิ่งใหญ่อย่างที่คาดไว้ เพราะทีมยังต้องขึ้นๆ ลงๆ อยู่เป็นประจำระหว่างดิวิชั่น 1 และดิวิชั่น 2 จนในปีค.ศ. 1954 ลิเวอร์พูลต้องลงไปเล่นอยู่ในดิวิชั่น 2 นานกว่าปกติและก็ยังไม่มีผู้จัดการคนไหนสามารถพาทีมกลับขึ้นมาสู่ดิวิชั่น 1 ได้สักที จนเมื่อชายที่ชื่อว่า บิลล์ แชงค์ลี่ย์ เข้ามาคุมทีมได้เพียง 2 ฤดูกาล เขาก็พาทีมขึ้นมาสู่ดิวิชั่น 1 ในฐานะแชมป์ของดิวิชั่น 2 ได้สำเร็จในปีค.ศ. 1962 ซึ่งแชงค์ลี่ย์มีปรัชญาการคุมทีมอย่างง่ายๆ คือ ฟุตบอลแบบพื้นๆ แต่เน้นการส่ง และรับบอล อย่างแม่นยำ เล่นกันเป็นทีมมากกว่า ซึ่งเป็นหัวใจสำคัญของทีมลิเวอร์พูลมาจวบจนปัจจุบัน")
    st.header("บ็อบ เพสลี่ย์ ผู้สืบทอดของแชงค์ลี่ย์")
    st.image("bob.jpg")
    st.write("แต่หลังจากอังกฤษคว้าแชมป์โลก บิลล์ แชงค์ลี่ย์ ก็ประกาศลาออกจากตำแหน่งในปี 1973 หลังจากพาลิเวอร์พูลคว้าแชมป์ยูฟ่า คัพได้ในปี 1972 โดยมีบ๊อบ เพสลี่ย์ มีขวาของเขามารับช่วงต่อแทน และบ๊อบใช้เวลาเพียง 4 ปี ในการพาลิเวอร์พูลคว้าแชมป์ยูโรเปี้ยน คัพเป็นครั้งแรกได้สำเร็จ และในปีต่อมาเขาก็พาลิเวอร์พูลประกาศความยิ่งใหญ่อีกครั้งเมื่อพาทีมคว้าดับ เบิ้ลแชมป์ จากดิวิชั่น 1 และยูโรเปี้ยน คัพ มาครอง อีกทั้งยังคว้าแชมป์ยูโรเปี้ยน คัพมาได้อีก 2 ครั้งในปี 1981 และ 1984 ก่อนที่บ็อบ เพสลีย์จะลาออกจากตำแหน่ง")
    st.header("จาก โจ ฟาแกน ถึง คิง เคนนี่")
    st.image("jo.jpg")
    st.write("โจ เฟแกน คือผู้จัดการทีมต่อจากบ็อบ เพสลี่ย์ ซึ่งในการคุมทีมของเขาได้เกิดโศกนาฏกรรมขึ้น มีผู้เสียชีวิต 39 คนจากการที่ทีมลิเวอร์พูลแพ้ทีมยูเวนตุส 1-0 จากลูกจุดโทษ ในรอบชิงชนะเลิศฟุตบอลยูโรเปี้ยน คัพ ที่สนามเฮย์เซล สเตเดี้ยม ในกรุงบรัสเซลล์ ประเทศเบลเยี่ยม")
    st.header("ยุคแห่งการเปลี่ยนแปลง")
    st.write("หลังจากในปี 1990 หรือตั้งแต่ดัลกลิช ทนรับความเครียดจากเหตุการณ์เศร้าสลดที่ สนามฮิลส์โบโร่ ได้จึงลาออกจากการคุมทีม จากนั้นมาลิเวอร์พูลก็ไม่ประสบความสำเร็จในลีกสูงสุดอีกเลยไม่ว่าจะเป็นยุค ของแกรม ซูเนส, รอย อีแวนส์, หรือเชรา อุลลิเยร แม้ว่าอุลลิเยร์จะสามารถคว้าทริปเปิลแชมป์ ในปี 2001 คือ League Cup, UEFA Cup และFA Cupัพ แต่ดูเหมือนว่าไม่ใช่ความสำเร็จที่แฟนบอลรอคอยนัก มีดวามเปลี่ยนแปลงหลายอย่างเกิดขึ้นในทีม ทั้งวิธีการซื้อนักเตะ รูปแบบการเล่น ซึ่งนั่นอาจจะเป็นอีกเหตุผลหนึ่งที่ทำให้ลิเวอร์พูลประสบปัญหาในเรื่องฟอร์ม การเล่น")
    st.header("การปฏิรูปครั้งใหญ่ของบินิเตส")
    st.image("9.jpg")
    st.write("ราฟาเอล เบนิเตส ผู้จัดการทีมคนใหม่ที่แฟนๆ หงส์แดงฝากความหวังไว้มากทีเดียว เขาผ่าตัดทีมลิเวอร์พูลครั้งใหญ่ พร้อมทั้งนำทั้งสต๊าฟและผู้เล่นชาวสเปนเข้ามาเสริมทีมหลายคน แม้ผลงานในลีกอังกฤษจะไม่ดีอย่างที่แฟนๆคาดไว้ แต่ผลงานของทีมในระดับประเทศยุโรปนั้นดีมากๆ จากการที่เขานำทีมคว้าแชมป์ UEFA Champions League และในฤดูกาลที่ผ่านมาเขาก็นำทีมคว้าแชมป์ FA Cup 2006 ได้อีกด้วย แถมทีมก็อยู่ในอันดับ 3 ของลีกอีกต่างหาก ส่วนในฤดูกาลนี้จะสามารถคว้าเอาแชมป์พรีเมียร์ชิพแรกของทีมได้หรือไม่...")

if st.sidebar.button("สนามแอนฟิลด์/Anfield Stadium"):
     with st.spinner("......"):
          time.sleep(1)
     
     st.header("สนามแอนฟิลด์")
     st.image("anfield.jpeg")
     st.write("สนามแอนฟีลด์ ในปัจจุบันเป็นสนามที่นั่งทั้งหมด โดยมีที่นั่งรองรับจำนวนผู้เข้าชมได้ 45,577 ที่นั่ง ตลอดช่วงศตวรรษที่ผ่านมาสนามแห่งนี้ ก็ได้มีการปรับปรุงมาโดยตลอดเพื่อห้มีความทันสมัยและเหมาะสมกับกาลเวลา")
     st.write("อัฒจันทร์หลัก หรือว่า เมน สแตนด์ (Main Stand) นั้น ถือว่าเป็นหัวใจหลักของสนามแห่งนี้ เพราะว่านอกจากจะเป็นอัฒจันทร์ที่เก่าแก่ที่สุดในขณะนี้แล้ว ห้องเปลี่ยนเครื่องแต่งตัวของนักเตะ ที่นั่งของนักเตะ และ ผู้จัดการทีม รวมถึง ผู้บริหาร กับ แขกรับเชิญพิเศษนั้น ลั้วนแล้วแต่อยู่ภายใน บริเวณ อํฒจันทร์ เมน สแตนด์ ทั้งหมด")
     st.write("ความจุของ เมน สแตนด์ ในปัจจุบันนั้นอยู่ที่ 12,277 ที่นั่ง แต่นับตั้งแต่กลางเดือนพฤษภาคมของ ปี 2016 ทางสโมสรได้เริ่มต้นการขยายต่อเติมอัฒจันทร์แห่งนี้ ซึ่งจะทำให้มีจำนวนที่นั่งเพิ่มขึ้น 8,500 ที่นั่ง และจะทำให้จำนวนที่นั่งรวมของอัฒจันทร์แห่งนี้เพิ่มขึ้นเป็น 20,000 ที่นั่ง")
     st.image('an2.jpg')
     st.write("ตรงกันข้ามกับ อัฒจันทร์ เมน สแตนด์ ในปัจจุบันก็คือ เซ็นเท็นแนรี่ สแตนด์ ที่ทำการเปิดใช้ครั้งแรกใน ค.ศ. 1992 ซึ่งเป็นปีที่สโมสรครบรอบ 100 ปี และเป็นที่มาของชื่อของอัฒจันทร์แห่งนี้นั่นเอง โดย เซ็นเท็นแนรี่ สแตนด์ นั้น เป็นอัฒจันทร์ 2 ชั้น มีความจุรวมกว่า 12,000 ที่นั่ง นอกจากนี้ยังมี ห้องชม ส่วนตัว ประมาณ 30 ห้อง และ ห้องเลี้ยงรับรองที่จะมีอาหารคอยเสิร์ฟให้กับผู้ถือตั๋ว วี ไอ พี  อีกด้วย")
     st.write("สำหรับ อัฒจันทร์ที่มีชื่อเสียงที่สุดของ แอนฟีลด์ ก็คือ อัฒจันทร์ เดอะค็อป หรือ ชื่อเต็ม คือ เดอะ สปีอ้อน ค็อป นั้น ถือกำเนิดขึ้นมาจากการปรับปรุงอัฒจันทร์ ฝั่งถนน วอลตั้น เบร็ค ในปี ค.ศ. 1906 โดยนำดินและเศษหินมาก่อตัวเป็นเนินเอียงก็สร้างที่ยืนชมด้วยคอนกรีตทับลงไปโดยเป็นแนวขั้นบันได และมีราวเหล็กกั้นเพื่อป้องกันการล้ม")
     st.write("อัฒจันทร์ เดอะค็อป หรือ ชื่อเต็มว่า เดอะสปีอ้อน ค็อป นั้น ถือกำเนิดเกิดขึ้นมาจากการปรับปรุงอัฒจันทร์ฝั่งถนน วอลตั้น เบร็ค ในปี ค.ศ.1906 จากคำสั่งของ จอห์น โฮลดิ้ง ประธานสโมสร และจอห์น แม็คเค็นน่าเพื่อเป็นการเฉลิมฉลองการคว้าแชมป์ของสโมสร โดยนำเอาเศษหิน และ ดิน มาอัดแน่นเพื่อก่อตัวให้เป็นเนินเอียงจากนั้นก็สร้างที่ยืนชมเป็นแนวขั้นบันไดด้วยคอนกรีตทับลงไปบนเนินดิน และ มีราวเหล็กกั้นเพื่อป้องกันการล้ม และ การไหลเป็นคลื่นของแฟนบอลที่ยืนอยู่บนอัฒจันทร์")
     st.image('an3.jpg')
     st.write("เดอะค็อปใด้ต้อนรับสาวกที่เข้ามาส่งแรงใจแรงเชียร์นับแต่นั้นมา แต่โดยปราศจากหลังคา จนกระทั่ง ค.ศ. 1928 ถึงได้มีการสร้างหลังคา และ เมื่อหลังคาสร้างเสร็จแล้ว ก็ได้ฤกษ์เปิดอัฒจันทร์ แห่งนี้ อย่างเป็นทางการเสียทีดย จอห์น แม็คเค็นน่า")
     st.write("จากนั้นเดอะค็อปก็ได้คงสภาพเดิมและอยู่เคียงข้างแอนฟีลด์มาตลอดจนกระทั่ง ค.ศ. 1994เดอะค็อปก็ถูกสร้างขึ้นใหม่โดยเปลี่ยนจาก อัฒจันทร์ ยืนทั้งหมด มาเป็นนั่งทั้งหมดเพื่อความปลอดภัของแฟนบอลที่เข้ามาชมการแข่งขันในสนาม โดยในปัจจุบัน อัฒจันทร์ เดอะค็อป สามารถจุผู้ชมได้กว่า 12,000 คน")
     st.write("ส่วนอัฒจันทร์ที่มีชื่อเดียวกับชื่อสนามก็คือ อัฒจันทร์ แอนฟีลด์ เนื่องจากอัฒจันทร์ฝั่งนี้อยู่ติดกับถนน แอนฟีลด์ และ ได้รับการสร้างใหม่ และ ปรับปรุง หลายครั้ง โดยครั้งล่าสุด คือ ใน ค.ศ. 1998 เมื่อ แอนฟีลด์ กลายเป็นอัฒจันทร์ 2 ชั้น ด้วยการสร้างใหม่ และ หลังจากนั้นไม่นาน ก็มีการนำเสา มาเสริม ด้านหลังเพื่อค้ำอัฒจันทร์ชั้น 2 ทั้งนี้เพื่อเสริมความแข็งแกร่งให้มีมากขึ้น ในอนาคตอันไม่ไกล อัฒจันทร์ ฝั่งแอนฟีลด์ ก็อาจจะได้รับการปรับปรุงอีก เพื่อความจุที่นั่งของสนาม ซึ่งถ้าสโมสรตัดสินใจ ที่จะขยาย ความจุของสนาม แล้วล่ะก็ อัฒจันทร์ฝั่งแอนฟีลด์ จะกลายเป็นอัฒจันทร์ 3 ชั้น ขึ้นมาโดยปริยาย")

if st.sidebar.button("ตราสัญลักษณ์/Logo"):
     with st.spinner("......"):
          time.sleep(1)

     st.header("ตราสัญลักษณ์")
     st.image('logo.png')
     st.subheader("ที่มาตราสัญลักษณ์")
     st.write("แต่เมื่อก่อนสัญลักษณ์ของเมืองลิเวอร์พูลตั้งแต่สมัย King John ในศตวรรษที่ 13 ได้ทรงใช้นกอินทรีซึ่งเป็นสัญลักษณ์ของนักบุญ Saint John เป็นตราสัญลักษณ์ประจำพระองค์ พระองค์ได้มีบทบาทสำคัญในการพัฒนาเมืองท่าเล็กๆ แห่งหนึ่งซึ่งสมัยนั้นรู้จักกันในชื่อ Lerpoole เพื่อใช้เป็นฐานทัพแห่งหนึ่งของอังกฤษ ซึ่งต่อมาได้กลายเป็นเมืองลิเวอร์พูลในปัจจุบัน")
     st.write("เมื่อลิเวอร์พูลได้ยกระดับตัวเองขึ้นเป็นเมืองในปี 1797 ตราประจำกองทหารสมัยนั้นเป็นรูปนก Cormorant คาบสาหร่ายทะเลที่เรียกว่า laver มาใช้ทำรัง ซึ่งต่อมาได้แผลงเป็นชื่อเมือง (Liver) และได้มีความเข้าใจกันว่า Liver Birds ที่พูดถึงกันทั่วไปน่าจะเป็นเจ้านก Cormorant หรือนกกาน้ำนั่นเอง เมื่อสโมสรฟุตบอลลิเวอร์พูลก่อตั้งในปี 1892 นก Liver Bird ก็ถูกนำมาใช้เป็นสัญลักษณ์ของสโมสรหลังจากที่แยกออกมาจาก Everton ตามสัญลักษณ์ของเมืองจนถึงปัจจุบัน")
     st.image("br.jpg")

if st.sidebar.button("ชุดแข่ง/Kit"):  
     with st.spinner("......"):
          time.sleep(1)  

     col1, col2, col3 = st.columns(3)
     
     with col1:
          st.header("Home Kit")
          st.image("https://vintagejoint.co.za/cdn/shop/products/I2KDPEGUmFvnN7s_1800x1800.jpg?v=1686996366") 

     with col2:
          st.header("Away Kit")
          st.image("https://store.liverpoolfc.com/media/catalog/product/cache/dd504f005c0b90ffe1b9fb2344db1a87/l/u/luis_diaz-220.jpg") 

     with col3:
          st.header("Third Kit")
          st.image("https://www.soccerbible.com/media/150184/liverpool-3-min.jpg") 

if st.sidebar.button("การสนับสนุน/Support"):  
     with st.spinner("......"):
          time.sleep(1)    

          st.header("การสนับสนุน")
          st.write("ลิเวอร์พูลเป็นหนึ่งสโมสรที่ได้รับการสนับสนุนมากที่สุดในโลก ลิเวอร์พูลแถลงว่ามีฐานผู้สนับสนุนทั่วโลก โดยมีผู้สนับสนุนสโมสรได้รับการยอมรับอย่างเป็นทางการมากกว่า 200 แห่งในอย่างน้อย 50 ประเทศ กลุ่มที่มีชื่อเสียง เช่น สปิริตออฟแชงคลี สโมสรจะใช้ประโยชน์จากการสนับสนุนนี้ผ่านการทัวร์ฤดูร้อนทั่วโลก ซึ่งรวมถึงการลงเล่นต่อหน้าผู้ชมจำนวน 101,000 คนที่มิชิแกนในสหรัฐ และผู้ชมจำนวน 95,000 คนที่เมลเบิร์นในออสเตรเลียผู้สนับสนุนของลิเวอร์พูลมักเรียกตัวเองว่าเป็น คอปิตส์ ซึ่งอ้างอิงถึงผู้สนับสนุนที่เคยยืนและนั่งบนอัฒจันทร์เดอะค็อปที่แอนฟีลด์ ใน ค.ศ. 2008 ผู้สนับสนุนของลิเวอร์พูลได้ก่อตั้งสโมสรชื่อว่า เอเอฟซี ลิเวอร์พูล ซึ่งลงเล่นในเกมการแข่งขันให้สำหรับผู้สนับสนุนที่ไม่มีเงินดูฟุตบอลพรีเมียร์ลีก")
          st.write("ผู้สนับสนุนของสโมสรได้เข้าไปเกี่ยวข้องกับโศกนาฏกรรมที่สำคัญ 2 ครั้ง ครั้งแรกคือ ภัยพิบัติสนามกีฬาเฮย์เซลเมื่อ ค.ศ. 1985 ทำให้ผู้สนับสนุนยูเวนตุสเสียชีวิต 39 คน พวกเขาถูกขังอยู่ที่มุมหนึ่งโดยผู้สนับสนุนลิเวอร์พูลที่พุ่งเข้ามาหาพวกเขา น้ำหนักของผู้สนับสนุนที่อยู่มุมนั้นทำให้กำแพงพังลงมา ยูฟ่ากล่าวโทษเหตุการณ์ที่เกิดขึ้นว่าเป็นความผิดของผู้สนับสนุนลิเวอร์พูลแต่เพียงผู้เดียว และระงับสิทธิ์สโมสรอังกฤษทั้งหมดจากการแข่งขันรายการฟุตบอลยุโรปเป็นเวลาห้าปี ลิเวอร์พูลได้รับโทษแบนเพิ่มเติมจนไม่สามารถเข้าร่วมยูโรเปียนคัพฤดูกาล 1990–91 แม้ว่าจะชนะเลิศลีกสูงสุดใน ค.ศ. 1990 ก็ตาม ผู้สนับสนุนยี่สิบเจ็ดคนถูกจับในข้อหาฆ่าผู้อื่นโดยไม่เจตนาและถูกส่งตัวไปยังเบลเยียมเพื่อเข้าร่วมการพิจารณาคดีเมื่อ ค.ศ. 1987 ใน ค.ศ. 1989 หลังการพิจารณาคดีห้าเดือนในเบลเยียม ผู้สนับสนุนลิเวอร์พูล 14 คนได้รับโทษจำคุก 3 ปีจากความผิดฐานฆ่าผู้อื่นโดยไม่เจตนา โทษจำคุกกึ่งหนึ่งให้รอลงอาญา")
          st.write("ภัยพิบัติครั้งที่สองเกิดขึ้นในเอฟเอคัพ รอบรองชนะเลิศ ระหว่างลิเวอร์พูลกับนอตทิงแฮมฟอเรสต์ที่สนามกีฬาฮิลส์โบโรในเชฟฟิลด์ เมื่อวันที่ 15 เมษายน ค.ศ. 1989 ผู้สนับสนุนลิเวอร์พูล 96 คน เสียชีวิตจากการที่ผู้ชมเข้ามาในอัฒจันทร์ฝั่งแลปปิงส์เลนเอ็น ซึ่งกลายเป็นที่รู้จักในชื่อภัยพิบัติฮิลส์โบโร วันต่อมา หนังสือพิมพ์ เดอะซัน ได้ตีพิมพ์บทความ เดอะทรูธ ซึ่งอ้างว่าแฟนลิเวอร์พูลได้ปล้นคนที่เสียชีวิตกับโจมตีและปัสสาวะใส่ตำรวจ จากการสอบสวน ข้อกล่าวหานั้นไม่เป็นความจริง นำไปสู่การคว่ำบาตรหนังสือพิมพ์ โดยผู้สนับสนุนลิเวอร์พูลทั่วเมืองและที่อื่น ๆ หลายคนยังปฏิเสธที่จะซื้อ เดอะซัน แม้เวลาจะผ่านมาแล้ว 30 ปี องค์กรสนับสนุนหลายแห่งได้ก่อตั้งขึ้นหลังเกิดภัยพิบัติ เช่น การรณรงค์เพื่อความยุติธรรมของฮิลส์โบโร ซึ่งเป็นตัวแทนของครอบครัวผู้สูญเสีย ผู้รอดชีวิตและผู้สนับสนุนในความพยายามที่จะรักษาความยุติธรรม")

if st.sidebar.button("คู่แข่ง/Derby Match"):  
     with st.spinner("......"):
          time.sleep(1)

          st.header("คู่แข่ง")
          st.write("คู่แข่งของลิเวอร์พูลที่แข่งขันด้วยกันยาวนานที่สุดก็คือเอฟเวอร์ตัน โดยเรียกการแข่งขันนี้ว่าเมอร์ซีย์ไซด์ดาร์บี จุดเริ่มต้นของการเป็นคู่แข่งนั้นเกิดขึ้นตั้งแต่การก่อตั้งของลิเวอร์พูลและข้อพิพาทระหว่างคณะกรรมการของเอฟเวอร์ตันกับเจ้าของแอนฟีลด์ เมอร์ซีย์ไซด์ดาร์บีเป็นหนึ่งในดาร์บีท้องถิ่นที่ไม่มีการบังคับแบ่งแยกผู้สนับสนุนทั้งสองฝ่าย จึงเป็นที่รู้จักในฐานะ ดาร์บีมิตรภาพ ตั้งแต่กลางทศวรรษ 1980 การแข่งขันเริ่มทวีความรุนแรงมากขึ้น ทั้งในสนามและนอกสนาม โดยเฉพาะตั้งแต่ก่อตั้งพรีเมียร์ลีกใน ค.ศ. 1992 เมอร์ซีย์ไซด์ดาร์บีเป็นการแข่งขันที่มีผู้เล่นได้รับใบแดงและถูกไล่ออกจากสนามมากกว่านัดการแข่งขันอื่น ๆ เรียกได้ว่าเป็น การแข่งขันที่ไร้กติกาและเดือดที่สุดในพรีเมียร์ลีก ในแง่ของการสนับสนุนภายในเมือง จำนวนของผู้สนับสนุนลิเวอร์พูลนั้นมีมากกว่าเอฟเวอร์ตันในอัตราส่วน 2:1")
          st.write("ความเป็นคู่แข่งของลิเวอร์พูลกับแมนเชสเตอร์ยูไนเต็ดเกิดขึ้นมาตั้งแต่การแข่งขันของทั้งสองเมืองในช่วงการปฏิวัติอุตสาหกรรมในศตวรรษที่ 19 ทั้งสองเมืองเชื่อมถึงกันด้วยทางรถไฟระหว่างเมืองแห่งแรกของโลกและทางถนน ลิเวอร์พูลและแมนเชสเตอร์นั้นห่างกันไปตามถนนอีสแลงซ์สประมาณ 30 ไมล์ (48 กิโลเมตร) นิตยสาร ฟรานซ์ฟุตบอล จัดอันดับให้ลิเวอร์พูลและแมนเชสเตอร์ยูไนเต็ดเป็นสองสโมสรที่ใหญ่ที่สุดในอังกฤษ ทั้งสองสโมสรเป็นทีมจากอังกฤษที่ประสบความสำเร็จมากที่สุดทั้งในประเทศและต่างประเทศ และก็มีผู้สนับสนุนทั่วโลก")
          st.write("การแข่งขันนี้ถูกมองว่าเป็นหนึ่งในคู่แข่งขันที่ยิ่งใหญ่ที่สุดในโลกฟุตบอลและเป็นการแข่งขันที่มีชื่อเสียงที่สุดในฟุตบอลอังกฤษ ทั้งสองสโมสรผลัดกันชนะเลิศระหว่าง ค.ศ. 1964 ถึง 1967 และแมนเชสเตอร์ยูไนเต็ดกลายเป็นทีมจากอังกฤษทีมแรกที่ชนะเลิศยูโรเปียนคัพใน ค.ศ. 1968 ก่อนที่ลิเวอร์พูลจะชนะเลิศในรายการยูโรเปียนคัพ 4 สมัยในเวลาต่อมา เมื่อรวมกันแล้วทั้งสองสโมสรชนะเลิศลีกสูงสุด 39 สมัยและยูโรเปียนคัพ 9 สมัย ทั้งสองสโมสรนั้นประสบความสำเร็จต่างช่วงเวลา ลิเวอร์พูลชนะเลิศลีกสูงสุดในช่วงทศวรรษ 1970 และ 1980 ซึ่งเป็นช่วงเวลาเดียวกับที่แมนเชสเตอร์ยูไนเต็ดไม่ชนะเลิศลีกสูงสุดยาวนาน 26 ปี และความสำเร็จของแมนเชสเตอร์ยูไนเต็ดในยุคพรีเมียร์ลีก เป็นช่วงเวลาเดียวกับที่ลิเวอร์พูลไม่ชนะเลิศลีกสูงสุดยาวนาน 30 ปี และทั้งสองสโมสรจบฤดูกาลเป็นที่หนึ่งกับที่สองในลีกด้วยกันแค่ห้าครั้งเท่านั้น ด้วยความเป็นคู่แข่ง ทำให้ทั้งสองสโมสรทำการซื้อขายผู้เล่นระหว่างกันน้อยมาก ผู้เล่นคนสุดท้ายที่ย้ายระหว่างสองสโมสรคือ ฟิล ชิสนอลล์ ที่ย้ายจากลิเวอร์พูลไปแมนเชสเตอร์ยูไนเต็ดเมื่อ ค.ศ. 1964")

if st.sidebar.button("ความเป็นเจ้าของ/ownership"):  
     with st.spinner("......"):
          time.sleep(1)

          st.header("ความเป็นเจ้าของและฐานะทางการเงิน")
          st.write("จอห์น โฮลดิง เป็นประธานคนแรกของสโมสร ในฐานะที่เป็นเจ้าของแอนฟีลด์และผู้ก่อตั้งของลิเวอร์พูล เขาดำรงตำแหน่งตั้งแต่ ค.ศ. 1892 จนถึง ค.ศ. 1904 ต่อมา จอห์น แมกเคนนา เข้ามารับตำแหน่งเป็นประธานสโมสรหลังจากที่โฮลดิงออกไปและได้กลายเป็นประธานของฟุตบอลลีก มีการผลัดเปลี่ยนตำแหน่งประธานสโมสรอยู่หลายคน ก่อนที่จอห์น สมิธ ซึ่งพ่อของเขาเป็นผู้ถือหุ้นของสโมสร เข้ามารับตำแหน่งใน ค.ศ. 1973 เขาเป็นประธานสโมสรในช่วงเวลาที่ประสบความสำเร็จมากที่สุดในประวัติศาสตร์ของลิเวอร์พูล ก่อนที่เขาจะก้าวลงจากตำแหน่งใน ค.ศ. 1990 โนเอล ไวต์ เข้ารับตำแหน่งประธานสโมสรในปีเดียวกัน เดวิด มัวร์ส ซึ่งครอบครัวของเขาเป็นเจ้าของสโมสรยาวนานกว่า 50 ปี เข้ามารับตำแหน่งประธานสโมสรใน ค.ศ. 1991 ลุงของเขา จอห์น มัวร์ส เคยเป็นผู้ถือหุ้นของลิเวอร์พูลและเคยเป็นประธานของเอฟเวอร์ตัน ตั้งแต่ ค.ศ. 1961 ถึง 1973 มัวร์สเป็นเจ้าของสโมสรร้อยละ 51 และใน ค.ศ. 2004 เขาแสดงความเต็มใจที่จะพิจารณาการเสนอราคาสำหรับหุ้นของเขาในลิเวอร์พูล")
          st.write("ท้ายที่สุด มัวร์สขายสโมสรให้กับนักธุรกิจชาวอเมริกัน จอร์จ ยิลเลตต์ และทอม ฮิกส์ เมื่อวันที่ 6 กุมภาพันธ์ ค.ศ. 2007 โดยที่ข้อตกลงมีมูลค่าสโมสรและหนี้คงค้างที่ 218.9 ล้านปอนด์ ทั้งสองคนจ่าย 5,000 ปอนด์ต่อหุ้น หรือ 174.1 ล้านปอนด์สำหรับการถือหุ้นทั้งหมดและ 44.8 ล้านปอนด์เพื่อชำระหนี้สินของสโมสร ความขัดแย้งระหว่างยิลเลตต์กับฮิกส์และการที่ผู้สนับสนุนไม่สนับสนุนพวกเขา ทำให้ทั้งสองคนต้องการขายสโมสร มาร์ติน บรอตัน ได้รับการแต่งตั้งเป็นประธานสโมสรเมื่อวันที่ 16 เมษายน ค.ศ. 2010 เพื่อดูแลการขายสโมสร ในเดือนพฤษภาคม ค.ศ. 2010 มีบัญชีที่แสดงให้เห็นว่าบริษัทโฮลดิงของสโมสรมีหนี้ 350 ล้านปอนด์ (เนื่องจากการซื้อสโมสรที่ใช้เงินจากการยืม) พร้อมกับขาดทุน 55 ล้านปอนด์ ทำให้ผู้สอบบัญชีอย่างเคพีเอ็มจีมีคุณสมบัติเป็นผู้ทำรายงานตรวจสอบบัญชี กลุ่มของเจ้าหนี้รวมไปถึงรอยัลแบงก์ออฟสกอตแลนด์นำตัวยิลเลตต์กับฮิกส์ขึ้นศาล และบังคับให้พวกเขาอนุญาตให้คณะกรรมการดำเนินการขายสโมสรและสินทรัพย์หลักของบริษัทโฮลดิง คริสโตเฟอร์ ฟลอยด์ ผู้พิพากษาศาลสูง ตัดสินให้เจ้าหนี้ชนะคดีและปูทางให้เกิดการขายสโมสรให้กับเฟนเวย์สปอร์ตกรุป (อดีต นิวอิงแลนด์สปอร์ตเวนเจอร์ส) ถึงแม้ว่ายิลเลตต์กับฮิกส์ยังคงมีตัวเลือกในการอุทธรณ์ ยิลเลตต์กับฮิกส์ขายลิเวอร์พูลให้กับเฟนเวย์สปอร์ตกรุปเมื่อวันที่ 15 ตุลาคม ค.ศ. 2010 เป็นจำนวนเงิน 300 ล้านปอนด์")

if st.sidebar.button("ผู้เล่น/Player"):  
     with st.spinner("......"):
          time.sleep(1)

     
          st.header("ผู้เล่น")
          st.subheader("GOALKEEPERS") 
          st.write("Alisson Becker :: Adrian :: Caoimhin Kelleher")
          st.subheader("DEFENDERS")         
          st.write("Joe Gomez  :: Virgil van Dijk :: Ibrahima Konate :: Kostas Tsimikas :: Andy Robertson :: Joel Matip :: Trent Alexander-Arnold :: Rhys Williams :: Jarell Quansah :: Conor Bradley")
          st.subheader("MIDFIELDERS")
          st.write("Wataru Endo :: Thiago Alcantara :: Dominik Szoboszlai :: Alexis Mac Allister :: Curtis Jones :: Harvey Elliott :: Ryan Gravenberch :: Stefan Bajcetic")
          st.subheader("FORWARDS")
          st.write("Luis Diaz :: Darwin Nunez :: Mohamed Salah :: Cody Gakpo :: Diogo Jota :: Ben Doak")

if st.sidebar.button("เกียรติประวัติ/trophy"):  
     with st.spinner("......"):
          time.sleep(1) 

          st.header("เกียรติประวัติ") 
          st.image("trophy.jpeg")  
          st.write("แชมป์ลีกสูงสุด (ดิวิชั่น 1 / พรีเมียร์ลีก) ( 19 สมัย ) : 1900-01, 1905-06, 1921-22, 1922-23, 1946-47, 1963-64, 1965-66, 1972-73, 1975-76, 1976-77, 1978-79, 1979-80, 1981-82, 1982-83, 1983-84, 1985-86, 1987-88, 1989-90, 2019-20")
          st.write("แชมป์ดิวิชั่น 2 ( 4 สมัย ) : 1893-94, 1895-96, 1904-05, 1961-62")
          st.write("แชมป์เอฟเอคัพ ( 8 สมัย ) : 1964-65, 1973-74, 1985-86, 1988-89, 1991-92, 2000-01, 2005-06, 2021-22")
          st.write("แชมป์ลีกคัพ / อีเอฟแอลคัพ ( 9 สมัย ) : 1980-81, 1981-82, 1982-83, 1983-84, 1994-95, 2000-01, 2002-03, 2011-12, 2021-22")
          st.write("ฟุตบอลลีกซูเปอร์คัพ ( 1 สมัย ) : 1985-86")
          st.write("แชมป์ยูโรเปี้ยนคัพ/ยูฟ่า แชมเปี้ยนส์ลีก ( 6 สมัย ) : 1976-77, 1977-78, 1980-81, 1983-84, 2004-05, 2018-19")
          st.write("แชมป์ยูฟ่าคัพ ( 3 สมัย ) : 1972-73, 1975-76, 2000-01")
          st.write("แชมป์ยูฟ่าซูเปอร์คัพ ( 4 สมัย ) : 1977, 2001, 2005, 2019")
          st.write("แชมป์ฟีฟ่าคลับเวิลด์คัพ ( 1 สมัย ) : 2019")
          st.write("ชนะเลิศคอมมิวนิตีชีลด์ ( 16 สมัย ) ( *แชมป์ร่วม ) : 1964*, 1965*, 1966, 1974, 1976, 1977*, 1979, 1980, 1982, 1986*, 1988, 1989, 1990*, 2001, 2006, 2022")

     